In [45]:
import pandas as pd
import kagglehub
import pycountry

#### Load the dataset

In [46]:
refugees = pd.read_csv('data/persons_of_concern.csv')
path_climat_changes = kagglehub.dataset_download('berkeleyearth/climate-change-earth-surface-temperature-data')
path_disasters = kagglehub.dataset_download('brsdincer/all-natural-disasters-19002021-eosdis')
temps = pd.read_csv(path_climat_changes + '/GlobalLandTemperaturesByCountry.csv')
disasters = pd.read_csv(path_disasters + '/DISASTERS/1900_2021_DISASTERS.xlsx - emdat data.csv')

In [47]:
refugees.head()

,Year,Country of Asylum,Country of Origin,Country of Asylum ISO,Country of Origin ISO,Refugees,Returned Refugees,Asylum Seekers,IDPs,Returned IDPs,Stateless,HST,OOC
0,1951,Australia,Unknown,AUS,UNK,180000,0,0,0,0,0,0,0
1,1951,Austria,Unknown,AUT,UNK,282000,0,0,0,0,0,0,0
2,1951,Belgium,Unknown,BEL,UNK,55000,0,0,0,0,0,0,0
3,1951,Canada,Unknown,CAN,UNK,168511,0,0,0,0,0,0,0
4,1951,Denmark,Unknown,DNK,UNK,2000,0,0,0,0,0,0,0

In [48]:
temps.head()

           dt  AverageTemperature  AverageTemperatureUncertainty Country
0  1743-11-01               4.384                          2.294   Åland
1  1743-12-01                 NaN                            NaN   Åland
2  1744-01-01                 NaN                            NaN   Åland
3  1744-02-01                 NaN                            NaN   Åland
4  1744-03-01                 NaN                            NaN   Åland

In [49]:
disasters.head()

,Year,Seq,Glide,Disaster Group,Disaster Subgroup,Disaster Type,Disaster Subtype,Disaster Subsubtype,Event Name,Country,...,No Affected,No Homeless,Total Affected,Insured Damages ('000 US$),Total Damages ('000 US$),CPI,Adm Level,Admin1 Code,Admin2 Code,Geo Locations
0,1900,9002,NaN,Natural,Climatological,Drought,Drought,NaN,NaN,Cabo Verde,...,NaN,NaN,NaN,NaN,NaN,3.221647,NaN,NaN,NaN,NaN
1,1900,9001,NaN,Natural,Climatological,Drought,Drought,NaN,NaN,India,...,NaN,NaN,NaN,NaN,NaN,3.221647,NaN,NaN,NaN,NaN
2,1902,12,NaN,Natural,Geophysical,Earthquake,Ground movement,NaN,NaN,Guatemala,...,NaN,NaN,NaN,NaN,25000.0,3.350513,NaN,NaN,NaN,NaN
3,1902,3,NaN,Natural,Geophysical,Volcanic activity,Ash fall,NaN,Santa Maria,Guatemala,...,NaN,NaN,NaN,NaN,NaN,3.350513,NaN,NaN,NaN,NaN
4,1902,10,NaN,Natural,Geophysical,Volcanic activity,Ash fall,NaN,Santa Maria,Guatemala,...,NaN,NaN,NaN,NaN,NaN,3.350513,NaN,NaN,NaN,NaN

In [50]:
temps['dt'] = pd.to_datetime(temps['dt'])
temps.dropna()

               dt  AverageTemperature  AverageTemperatureUncertainty   Country
0      1743-11-01               4.384                          2.294     Åland
5      1744-04-01               1.530                          4.680     Åland
6      1744-05-01               6.702                          1.789     Åland
7      1744-06-01              11.609                          1.577     Åland
8      1744-07-01              15.342                          1.410     Åland
...           ...                 ...                            ...       ...
577456 2013-04-01              21.142                          0.495  Zimbabwe
577457 2013-05-01              19.059                          1.022  Zimbabwe
577458 2013-06-01              17.613                          0.473  Zimbabwe
577459 2013-07-01              17.000                          0.453  Zimbabwe
577460 2013-08-01              19.759                          0.717  Zimbabwe

[544811 rows x 4 columns]

In [51]:
temps['year'] = temps['dt'].dt.year
temps = temps[(temps['year'] >= 2000) & (temps['year'] <= 2023)]